package ru.sberhealth.rgs;

public class Homework2 {

    public static void main(String[] args) {
        // Создать метод, который принимает массив целых чисел и возвращает его в обратном порядке

        // Создать метод, который принимает массив целых чисел и к каждому числу прибавляет предыдущее, затем возвращает массив с новыми значениями

        // Создать метод, который принимает массив целых чисел, считает среднее арифметическое всех входящих элементов и возвращает ответ в виде целого числа
        // Результат должен быть округлен в большую сторону

    }
}
