package ru.sberhealth.rgs;

public class HomeWork {

    // Задание 1
    // Написать метод, который будет конвертировать римские цифры в арабские. На вход должна приниматься строка
    // содержащая значение в римском формате (например 'XIX'). На выход должно выдаваться число, которое будет
    // равно значению (в данном случае 19). Нужно учитывать, что у римских цифр есть правило, что подряд не может быть более
    // трех одинаковых символов, например число 4 будет выражено не как IIII, а как IV, число 9 - IX, а не VIIII.
    // Значения римских цифр
    //    I = 1
    //    V = 5
    //    X = 10
    //    L = 50
    //    C = 100
    //    D = 500
    //    M = 1000

    // Задание 2
    // Написать метод, который будет принимать на вход целое число и проверять, что это число является палиндромом. Палиндром -
    // значит, что число читается слева направо и справа налево одинаково, например 1221 с обеих сторон читается как 1221.
    // Метод должен возвращать true, если число является палиндромом, и false, если нет.

}
