package ru.sberhealth.rgs;

public class Homework {

    // Все методы написать в этом классе, вызывать в классе Main в методе main

    // Написать метод, который будет считать начиная с 1 сумму каждого текущего числа и предыдущего. Число операций должно быть принято в качестве аргумента.
    // Метод должен вернуть число, которое получится в итоге

    // Написать метод, который будет принимать в себя массив целых чисел, каждое из них превращать в дробное, и возвращать массив дробных чисел
    // с теми же значениями, что и целые

    // Написать метод, который будет принимать в себя массив целых чисел в качестве аргумента, каждый второй элемент этого массива умножать на 2
    // и затем вернет массив с результатом этих операций. Не использовать оператор if

    // Написать метод, который принимает в себя массив строк и из них возвращает одну большую строку, каждый элемент в
    // результирующей строке отделяется от предыдущего запятой

    // Написать метод, который принимает в себя в качестве аргумента массив любых объектов, разворачивает его в обратном порядке
    // (первый элемент становится последним, последний элемент становится первым) и возвращает


}
