package ru.sberhealth.rgs;

public class Homework {

    // Создать в этом классе метод main, в котором показать работу своих классов и методов

    // Создать класс с описанием автомобиля. У него должны быть поля для обозначения модели, количества лошадиных сил,
    // типа (легковой или грузовой), количества колес. Создать конструктор по полям модель и количество лошадиных сил, создать геттеры и сеттеры для всех полей.
    // Сделать так, чтобы доступ к полям был возможен только внутри класса. Создать два экземпляра класса, установить им тип и вывести на экран значения их полей.

    // Создать класс, который будет хранить в себе статические методы: метод для расчета среднего арифметического элементов целочисленного массива,
    // метод для склеивания любого количества строк в одну, метод для расчета суммы всех входящих в массив элементов.

}
