package ru.sberhealth.rgs;

public class Homework {

    // 0. В файл pom.xml добавить зависимости для junit и hamcrest. На данный момент тестовые методы в классах
    // закомментированы, чтобы не было ошибок. После добавления зависимостей их можно будет раскомментировать, и все будет работать

    // 1. Написать недостающие тесты для класса PetShelter. Добавить тесты на методы putNewPetInShelter
    // и adopt. Проверить, что возвращается именно те значения, которые должны. Проверить все ветвления кода.
    // Также проверить, происходит добавление удаление в список. Сделать так, чтобы перед каждым тестом создавался новый
    // экземпляр PetShelter. Также сделать так, чтобы после каждого теста список питомцев очищался.

    // 2. Написать недостающие тесты для класса Calculator.
}