package ru.sberhealth.rgs;

public class Main {
}

/*
package ru.sberhealth.rgs.abstarct;

public class Homework {

    // Написать классы Truck, Boat и Plane, которые будут являться наследниками класса Vehicle и реализовывать
    // его абстрактные методы.
    Написать класс Garage, который будет хранить в себе список транспортных средств.

    // В классе Garage сделать метод, который будет добавлять новое транспортное средство в гараж. Также написать
    // метод, который будет выводить транспортное средство из гаража, используя метод для движения этого транспортного
    // средства.
    // Сделать метод showVehiclesInTheGarage в классе Garage, который будет выводить информацию о том, сколько каких транспортных средств
    // находится в гараже на данный момент. Вывод должен быть в виде:
    */
/*
    Today is 01.01.2024. Vehicles in the garage:
    Bike - 1;
    Car - 2;
    Truck - 0;
    Boat - 2;
    Plane - 1;
     *//*

    // Для того чтобы вывести на экран список транспортных средств, использовать метод String.format(), изучить, как им пользоваться.
    // Получить имя класса объекта можно, используя на объекте метод getClass().getSimpleName()
}*/
