package ru.sbrehealth.rgs;

public class Variables {

    public static void main(String[] args) {
        // Объявить переменную типа int, присвоить ей значение, вывести на экран в терминале

        // Объявить переменную типа String, присвоить ей значение, вывести на экран в терминале

        // Объявить две переменные типа int, вывести на экран в терминале их сумму

        // Объявить две переменные типа int, вывести на экран в терминале их разность

        // Объявить две переменные типа int, вывести на экран их произведение

        // Объявить две переменные типа double, вывести на экран в терминале результат деления первой на вторую

        // Объявить переменную типа boolean, вывести на экран в терминале ее значение

        // Объявить две переменные типа String (например "Эта строка из " и " слов") и одну переменную типа int (например 4) и склеить их таким образом,
        // чтобы получилась фраза

        // Объявить константу типа String и константу типа int и вывести на экран в терминале их сумму, чтобы получилась фраза

    }
}
